RhinoInside.Revit API Documentation
GeometryEncoder.ToArc Method
Overload List
Name | Description
ToArc(Arc)
 Converts the specified Rhino.Geometry.Arc to an equivalent of Autodesk.Revit.DB.Arc.
ToArc(Circle)
 Converts the specified Rhino.Geometry.Circle to an equivalent of Autodesk.Revit.DB.Arc.
Top
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace